{
  "technology": {
    "full": "<p><a href=\"https://piazza.com\">Piazza</a> will be used for announcements, general questions and discussions, clarifications about assignments, student questions to each other, and so on. If you are a UC Berkeley student enrolled in the course, and haven't already been added to Piazza, please <a href=\"/deeprlcourse/staff\">email Sid</a>.</p><p><a href=\"https://www.gradescope.com\">Gradescope</a> will be used to collect and grade assignments. If you are a UC Berkeley student enrolled in the course, and haven't already been added to Gradescope, please <a href=\"/deeprlcourse/staff\">email Sid</a>.</p><p>If you are not a UC Berkeley student or not enrolled, but are interested in following and discussing the course, there is a subreddit forum here that we will try to monitor: <a href=\"https://www.reddit.com/r/berkeleydeeprlcourse/\">reddit.com/r/berkeleydeeprlcourse/</a></p>"
  },
  "homeworks": {
    "full": "There will be five homeworks. For each homework, we will post a PDF on <a href=\"/deeprlcourse/\">the front page</a> and starter code on <a href=\"https://github.com/berkeleydeeprlcourse/homework\">Github</a>."
  },
  "slides": {
    "full": "We will post slides <a href=\"/deeprlcourse/\">on the front page</a> after each lecture."
  },
  "videos": {
    "full": "We will provide a <a href=\"https://www.youtube.com/c/CalESG/live\">live stream</a> of the lectures, as well as <a href=\"https://www.youtube.com/playlist?list=PLkFD6_40KJIxJMR-j5A1mkxK26gh_qg37\">video recordings</a>. The course is <b>not</b> being offered as an online course, and the videos are provided only for your personal informational and entertainment purposes. They are not part of any course requirement or degree-bearing university program."
  },
  "cheating": {
    "full": "We have a zero-tolerance policy for cheating. First-time offenses will result in negative points for the corresponding assignment and a meeting with the professors and/or head TAs. Second-time offenses will see more serious consequences, possibly a failing grade and definitely a referral to the Center for Student Misconduct."
  },
  "prevoffs": {
    "full": "A full version of this course was offered in <a href=\"http://rail.eecs.berkeley.edu/deeprlcourse-fa17/index.html\">Fall 2017</a> and <a href=\"http://rail.eecs.berkeley.edu/deeprlcoursesp17/index.html\">Spring 2017</a>. Lecture videos from Fall 2017 are available <a href=\"https://www.youtube.com/playlist?list=PLkFD6_40KJIznC9CDbVTjAF2oyt8_VAe3\">here</a>; those from Spring 2017, <a href=\"https://www.youtube.com/playlist?list=PLkFD6_40KJIwTmSbCv9OVJB3YaO4sFwkX\">here</a>. An abbreviated version of this course was offered in <a href=\"http://rail.eecs.berkeley.edu/deeprlcourse-fa15/index.html\">Fall 2015</a>."
  },
  "prereqs": {
    "full": "<a href=\"http://www.eecs189.org/\">CS189</a> or equivalent is a prerequisite for the course. This course will assume some familiarity with reinforcement learning, numerical optimization, and machine learning. For introductory material on RL and MDPs, see the <a href=\"http://ai.berkeley.edu/\">CS188 EdX course</a>, starting with <i>Markov Decision Processes I</i>, as well as Chapters 3 and 4 of <a href=\"http://webdocs.cs.ualberta.ca/~sutton/book/the-book.html\">Sutton & Barto</a>."
  },
  "late": {
    "full": "All assignments must be turned in via Gradescope on time. We will allow a total of five late days cumulatively. We will not make any additional allowances for late assignments: the late days are intended to provide for exceptional circumstances, and students should avoid using them unless absolutely necessary. Any assignments that are submitted late (with insufficient late days remaining) will not be graded."
  },
  "courses": {},
  "textbooks": {},
  "misclinks": {}
}
